# Taps
tap "homebrew/bundle"
tap "microsoft/mssql-release"
tap "romkatv/powerlevel10k"
tap "skyscanner/tools"

# Binaries
brew "ansible"
brew 'bash' # Latest Bash version
brew "cookiecutter"
brew 'coreutils' # Those that come with macOS are outdated
brew "curl"
brew "gh"
brew "git"
brew "gnutls"
brew "gnupg"
brew "grep"
brew 'jq'
brew 'mas' # Mac App Store manager
brew "nginx"
brew "parquet-cli"
brew "pinentry-mac"
brew "pipx"
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew "pnpm", link: false
brew "powerlevel10k"
brew "pyenv"
brew "qemu"
brew "terraform-docs"
brew "tfenv"
brew "unzip"
brew "wget"
brew "microsoft/mssql-release/msodbcsql"
brew "microsoft/mssql-release/mssql-tools"
brew "skyscanner/tools/turbolift"

# Fonts
cask "devtoys"
cask 'docker'
cask 'github'
cask 'brave-browser'
cask 'orbstack'
cask 'warp'
cask 'visual-studio-code'
cask 'zoom'
cask 'slack'
cask 'vincelwt-chatgpt'
cask 'sublime-text'
cask 'jetbrains-toolbox'
cask 'gather'
cask 'zoom'
cask 'raycast'
cask 'rectangle'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Apple Store
mas "BBEdit", id: 404009241
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541